const originData = [
{10 : 11},
{11 : 12},
{11 : 12},
{12 : 410},
{13 : 14},
{13 : 14},
{14 : 15},
{14 : 15},
{15 : 16},
{15 : 16},
{16 : 411},
{17 : 18},
{17 : 18},
{18 : 19},
{18 : 19},
{19 : 20},
{19 : 20},
{20 : 412},
{21 : 22},
{22 : 23},
{23 : 24},
{21 : 22},
{22 : 23},
{23 : 24},
{24 : 511},
{25 : 26},
{25 : 26},
{26 : 27},
{26 : 27},
{27 : 28},
{27 : 28},
{28 : 512},
{29 : 30},
{29 : 30},
{30 : 31},
{30 : 31},
{31 : 32},
{31 : 32},
{32 : 513},
{1 : 2},
{2 : 3},
{3 : 4},
{3 : 4},
{4 : 408},
{1 : 2},
{2 : 3},
{5 : 6},
{5 : 6},
{6 : 7},
{6 : 7},
{7 : 8},
{7 : 8},
{8 : 409},
{9 : 10},
{9 : 10},
{10 : 11},
{35 : 36},
{36 : 514},
{37 : 38},
{33 : 34},
{33 : 34},
{34 : 35},
{34 : 35},
{35 : 36},
{37 : 38},
{38 : 39},
{38 : 39},
{39 : 40},
{42 : 43},
{43 : 1316},
{39 : 40},
{40 : 515},
{41 : 42},
{41 : 42},
{42 : 43},
{44 : 45},
{44 : 45},
{45 : 46},
{45 : 46},
{46 : 1317},
{47 : 48},
{47 : 48},
{48 : 49},
{48 : 49},
{49 : 1318},
{50 : 51},
{50 : 51},
{51 : 52},
{51 : 52},
{52 : 1319},
{53 : 54},
{53 : 54},
{54 : 55},
{54 : 55},
{55 : 1320},
{56 : 57},
{56 : 57},
{57 : 451},
{58 : 59},
{58 : 59},
{59 : 452},
{60 : 61},
{60 : 61},
{61 : 453},
{62 : 63},
{62 : 63},
{63 : 454},
{64 : 65},
{64 : 65},
{65 : 455},
{66 : 67},
{66 : 67},
{67 : 334},
{68 : 69},
{69 : 335},
{68 : 69},
{70 : 71},
{70 : 71},
{71 : 336},
{72 : 73},
{72 : 73},
{73 : 337},
{74 : 75},
{74 : 75},
{75 : 338},
{76 : 77},
{76 : 77},
{77 : 339},
{78 : 79},
{78 : 79},
{79 : 340},
{80 : 81},
{80 : 81},
{81 : 341},
{84 : 85},
{85 : 343},
{82 : 83},
{84 : 85},
{82 : 83},
{83 : 342},
{86 : 87},
{86 : 87},
{87 : 456},
{88 : 89},
{88 : 89},
{89 : 457},
{90 : 91},
{90 : 91},
{91 : 458},
{92 : 93},
{92 : 93},
{93 : 459},
{94 : 95},
{94 : 95},
{95 : 460},
{96 : 97},
{96 : 97},
{97 : 329},
{98 : 99},
{99 : 330},
{98 : 99},
{100 : 101},
{100 : 101},
{101 : 331},
{102 : 103},
{102 : 103},
{103 : 332},
{104 : 105},
{104 : 105},
{105 : 333},
{106 : 107},
{106 : 107},
{107 : 461},
{108 : 109},
{108 : 109},
{109 : 462},
{110 : 111},
{110 : 111},
{111 : 463},
{112 : 113},
{112 : 113},
{113 : 464},
{114 : 115},
{114 : 115},
{115 : 465},
{116 : 117},
{117 : 118},
{117 : 118},
{118 : 481},
{119 : 120},
{120 : 121},
{121 : 482},
{119 : 120},
{120 : 121},
{122 : 123},
{116 : 117},
{122 : 123},
{123 : 124},
{123 : 124},
{124 : 483},
{125 : 126},
{126 : 127},
{127 : 484},
{125 : 126},
{126 : 127},
{128 : 129},
{129 : 130},
{130 : 485},
{128 : 129},
{129 : 130},
{131 : 132},
{131 : 132},
{132 : 133},
{132 : 133},
{133 : 686},
{134 : 135},
{134 : 135},
{135 : 136},
{135 : 136},
{136 : 687},
{137 : 138},
{137 : 138},
{138 : 139},
{138 : 139},
{139 : 688},
{140 : 141},
{140 : 141},
{141 : 142},
{141 : 142},
{142 : 689},
{143 : 144},
{144 : 145},
{145 : 690},
{146 : 147},
{143 : 144},
{144 : 145},
{149 : 150},
{150 : 151},
{146 : 147},
{147 : 148},
{147 : 148},
{149 : 150},
{150 : 151},
{152 : 153},
{152 : 153},
{153 : 154},
{153 : 154},
{155 : 156},
{156 : 157},
{155 : 156},
{156 : 157},
{158 : 159},
{158 : 159},
{159 : 160},
{161 : 162},
{159 : 160},
{161 : 162},
{162 : 163},
{235 : 236},
{162 : 163},
{239 : 240},
{164 : 165},
{164 : 165},
{165 : 166},
{165 : 166},
{167 : 168},
{168 : 169},
{167 : 168},
{168 : 169},
{170 : 171},
{170 : 171},
{171 : 172},
{173 : 174},
{171 : 172},
{173 : 174},
{174 : 175},
{174 : 175},
{176 : 177},
{176 : 177},
{177 : 178},
{177 : 178},
{178 : 851},
{179 : 180},
{179 : 180},
{180 : 181},
{180 : 181},
{181 : 852},
{182 : 183},
{182 : 183},
{183 : 184},
{183 : 184},
{184 : 853},
{185 : 186},
{185 : 186},
{186 : 187},
{186 : 187},
{187 : 854},
{188 : 189},
{188 : 189},
{189 : 190},
{189 : 190},
{190 : 855},
{191 : 192},
{191 : 192},
{192 : 941},
{193 : 194},
{193 : 194},
{194 : 942},
{195 : 196},
{195 : 196},
{196 : 943},
{197 : 198},
{197 : 198},
{198 : 944},
{199 : 200},
{201 : 202},
{199 : 200},
{200 : 945},
{201 : 202},
{202 : 506},
{203 : 204},
{203 : 204},
{204 : 507},
{205 : 206},
{205 : 206},
{206 : 508},
{207 : 208},
{207 : 208},
{208 : 509},
{209 : 210},
{209 : 210},
{210 : 510},
{211 : 212},
{213 : 214},
{215 : 216},
{213 : 214},
{214 : 642},
{215 : 216},
{216 : 643},
{217 : 218},
{217 : 218},
{218 : 644},
{219 : 220},
{219 : 220},
{220 : 645},
{221 : 222},
{211 : 212},
{212 : 641},
{221 : 222},
{222 : 591},
{223 : 224},
{223 : 224},
{224 : 592},
{225 : 226},
{226 : 593},
{225 : 226},
{227 : 228},
{227 : 228},
{228 : 594},
{229 : 230},
{229 : 230},
{230 : 595},
{231 : 232},
{231 : 232},
{233 : 234},
{233 : 234},
{237 : 238},
{235 : 236},
{237 : 238},
{239 : 240},
// No. 241 破碎之蒼魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/241
// No. 243 破碎之青魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/243
// No. 242 破碎之赤魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/242
// No. 244 破碎之白魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/244
// No. 245 破碎之黑魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/245
// No. 246 重生之蒼魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/246
// No. 247 重生之赤魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/247
// No. 248 重生之青魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/248
// No. 249 重生之白魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/249
// No. 250 重生之黑魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/250
// No. 251 共生之蒼魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/251
// No. 252 共生之赤魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/252
// No. 253 共生之青魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/253
// No. 258 永恆之青魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/258
// No. 254 共生之白魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/254
// No. 255 共生之黑魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/255
// No. 257 永恆之赤魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/257
// No. 256 永恆之蒼魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/256
// No. 259 永恆之白魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/259
// No. 260 永恆之黑魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/260
// No. 262 破殼水晶龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/262
// No. 261 水晶龍蛋, 找不到進化資訊: http://zh.tos.wikia.com/wiki/261
// No. 263 稀有水晶龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/263
// No. 264 詛咒之劍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/264
// No. 265 殺戮之劍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/265
// No. 266 魔神之劍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/266
// No. 267 蜜涎獸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/267
// No. 269 蜜月獸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/269
// No. 270 海洋小靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/270
// No. 268 蜜羽獸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/268
// No. 272 大地小靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/272
// No. 271 火焰小靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/271
// No. 273 神聖小靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/273
// No. 274 鬼魅小靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/274
// No. 275 海洋靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/275
// No. 277 大地靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/277
// No. 276 火焰靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/276
// No. 278 神聖靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/278
// No. 279 鬼魅靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/279
// No. 280 海洋千年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/280
// No. 281 火焰千年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/281
// No. 282 大地千年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/282
// No. 283 神聖千年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/283
// No. 284 鬼魅千年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/284
{285 : 742},
{286 : 674},
{288 : 703},
{287 : 739},
{289 : 704},
{290 : 850},
// No. 292 人面怪鳥, 找不到進化資訊: http://zh.tos.wikia.com/wiki/292
// No. 291 鬼魅萬年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/291
{293 : 998},
{294 : 295},
{294 : 295},
{295 : 296},
{297 : 298},
{295 : 296},
{296 : 1341},
{297 : 298},
{298 : 299},
{298 : 299},
{299 : 1342},
{300 : 301},
{300 : 301},
{301 : 302},
{301 : 302},
{302 : 1343},
{303 : 304},
{319 : 320},
{303 : 304},
{304 : 305},
{304 : 305},
{305 : 1344},
{306 : 307},
{306 : 307},
{307 : 308},
{321 : 322},
{323 : 324},
{325 : 326},
{307 : 308},
{308 : 1345},
{327 : 328},
{309 : 310},
{309 : 310},
{310 : 571},
{311 : 312},
{311 : 312},
{312 : 572},
{313 : 314},
{313 : 314},
{314 : 573},
{315 : 316},
{316 : 574},
{315 : 316},
{317 : 318},
{317 : 318},
{318 : 575},
{319 : 320},
{321 : 322},
{323 : 324},
{325 : 326},
{327 : 328},
{97 : 329},
{99 : 330},
{101 : 331},
{103 : 332},
// No. 350 寒霧劍塚 ‧ 卡戎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/350
{105 : 333},
{67 : 334},
{69 : 335},
{73 : 337},
// No. 351 機關傀儡 ‧ 紅月, 找不到進化資訊: http://zh.tos.wikia.com/wiki/351
{71 : 336},
{75 : 338},
// No. 353 鐵處女像 ‧ 浮士德, 找不到進化資訊: http://zh.tos.wikia.com/wiki/353
{77 : 339},
{79 : 340},
// No. 352 腐林魔女 ‧ 布萊爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/352
{81 : 341},
{83 : 342},
{344 : 345},
{85 : 343},
{344 : 345},
{345 : 1046},
{346 : 347},
{347 : 1047},
{346 : 347},
{348 : 349},
{348 : 349},
{349 : 1048},
{354 : 1525},
{355 : 356},
{355 : 356},
{356 : 816},
{357 : 358},
{357 : 358},
{358 : 817},
{359 : 360},
{359 : 360},
{360 : 818},
{361 : 362},
{361 : 362},
{362 : 819},
{363 : 364},
// No. 400 瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/400
{363 : 364},
{364 : 820},
{365 : 366},
{365 : 366},
{366 : 821},
{367 : 368},
{369 : 370},
{367 : 368},
{368 : 822},
// No. 431 貪婪精靈女王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/431
{369 : 370},
{370 : 823},
{371 : 372},
{371 : 372},
{372 : 824},
// No. 439 炎鎧戰士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/439
// No. 438 清泉守衛, 找不到進化資訊: http://zh.tos.wikia.com/wiki/438
// No. 440 雁目射手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/440
// No. 442 暗影鬥士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/442
// No. 441 萬劍寵僕, 找不到進化資訊: http://zh.tos.wikia.com/wiki/441
{373 : 374},
// No. 449 狂怒蜥蜴暴君, 找不到進化資訊: http://zh.tos.wikia.com/wiki/449
{373 : 374},
{374 : 825},
{375 : 376},
// No. 476 冰雪巫師 ‧ 波葛, 找不到進化資訊: http://zh.tos.wikia.com/wiki/476
// No. 477 惡作劇精靈 ‧ 波加特, 找不到進化資訊: http://zh.tos.wikia.com/wiki/477
{375 : 376},
{376 : 826},
{377 : 378},
// No. 478 掃除小精靈 ‧ 布朗尼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/478
// No. 480 色慾胎飼魔母, 找不到進化資訊: http://zh.tos.wikia.com/wiki/480
{377 : 378},
{378 : 827},
// No. 379 黃道星靈 ‧ 水, 找不到進化資訊: http://zh.tos.wikia.com/wiki/379
// No. 380 黃道星靈 ‧ 火, 找不到進化資訊: http://zh.tos.wikia.com/wiki/380
// No. 381 黃道星靈 ‧ 木, 找不到進化資訊: http://zh.tos.wikia.com/wiki/381
// No. 382 黃道星靈 ‧ 光, 找不到進化資訊: http://zh.tos.wikia.com/wiki/382
// No. 383 黃道星靈 ‧ 暗, 找不到進化資訊: http://zh.tos.wikia.com/wiki/383
// No. 384 占星者, 找不到進化資訊: http://zh.tos.wikia.com/wiki/384
// No. 385 見習小丑, 找不到進化資訊: http://zh.tos.wikia.com/wiki/385
// No. 386 無頭小丑, 找不到進化資訊: http://zh.tos.wikia.com/wiki/386
// No. 387 午夜之丑角, 找不到進化資訊: http://zh.tos.wikia.com/wiki/387
{388 : 389},
{390 : 391},
{388 : 389},
{390 : 391},
{392 : 393},
// No. 491 仰望者瘋帽, 找不到進化資訊: http://zh.tos.wikia.com/wiki/491
// No. 492 狂人三月兔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/492
// No. 493 建言者書頁蟲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/493
// No. 494 餐桌騎士睡鼠, 找不到進化資訊: http://zh.tos.wikia.com/wiki/494
{392 : 393},
// No. 495 魔郡咧齒貓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/495
{394 : 395},
{394 : 395},
{396 : 397},
{396 : 397},
{399 : 1627},
// No. 398 光輝萬年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/398
{401 : 588},
// No. 516 復活火鳥, 找不到進化資訊: http://zh.tos.wikia.com/wiki/516
// No. 517 魅影劍客, 找不到進化資訊: http://zh.tos.wikia.com/wiki/517
// No. 518 靈光飛刀手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/518
// No. 520 傲慢幽狼酋長, 找不到進化資訊: http://zh.tos.wikia.com/wiki/520
{402 : 589},
{403 : 706},
{404 : 707},
{405 : 708},
{407 : 710},
{406 : 709},
{4 : 408},
{8 : 409},
{12 : 410},
{16 : 411},
{413 : 414},
{20 : 412},
// No. 544 異界使者 ‧ 花蕊夫人, 找不到進化資訊: http://zh.tos.wikia.com/wiki/544
// No. 545 尋夢人 ‧ 馬休, 找不到進化資訊: http://zh.tos.wikia.com/wiki/545
// No. 547 腹蛇異兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/547
// No. 546 諾弗 ‧ 刻, 找不到進化資訊: http://zh.tos.wikia.com/wiki/546
// No. 548 異神之胎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/548
// No. 549 銀曉信徒, 找不到進化資訊: http://zh.tos.wikia.com/wiki/549
{413 : 414},
{414 : 1066},
// No. 550 噬土魔蟲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/550
{415 : 416},
{415 : 416},
{416 : 1067},
{551 : 552},
{553 : 554},
{555 : 556},
{557 : 558},
{559 : 560},
{419 : 420},
{417 : 418},
{417 : 418},
{418 : 1068},
// No. 563 負罪役夫 ‧ 尼祿, 找不到進化資訊: http://zh.tos.wikia.com/wiki/563
// No. 565 趨炎之手‧ 紅袍皇后, 找不到進化資訊: http://zh.tos.wikia.com/wiki/565
{564 : 979},
{443 : 566},
{444 : 567},
{445 : 568},
{447 : 570},
{446 : 569},
{419 : 420},
{420 : 1069},
{421 : 422},
{421 : 422},
{422 : 1070},
// No. 424 機關騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/424
// No. 576 繁衍之結晶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/576
// No. 423 異域法眼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/423
// No. 577 精華搜捕者, 找不到進化資訊: http://zh.tos.wikia.com/wiki/577
// No. 578 蘊魔晶寵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/578
// No. 425 永劫碑文像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/425
{486 : 581},
{487 : 582},
{488 : 583},
{489 : 584},
{490 : 585},
// No. 426 碧海萬年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/426
// No. 586 怠惰綽約聖女, 找不到進化資訊: http://zh.tos.wikia.com/wiki/586
// No. 427 熾焰萬年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/427
// No. 428 大地萬年靈魂石, 找不到進化資訊: http://zh.tos.wikia.com/wiki/428
// No. 587 棋盤之主 ‧ 白皇后, 找不到進化資訊: http://zh.tos.wikia.com/wiki/587
// No. 430 號角手加拉爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/430
// No. 429 追憶旅人, 找不到進化資訊: http://zh.tos.wikia.com/wiki/429
// No. 606 澄澈歌手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/606
// No. 607 炎炔樂師, 找不到進化資訊: http://zh.tos.wikia.com/wiki/607
// No. 608 靈木鼓手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/608
// No. 609 星魅琴師, 找不到進化資訊: http://zh.tos.wikia.com/wiki/609
{432 : 433},
{432 : 433},
// No. 610 空弦提琴手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/610
{434 : 435},
// No. 611 DAESUNG, 找不到進化資訊: http://zh.tos.wikia.com/wiki/611
// No. 612 TAEYANG, 找不到進化資訊: http://zh.tos.wikia.com/wiki/612
// No. 613 SEUNGRI, 找不到進化資訊: http://zh.tos.wikia.com/wiki/613
// No. 614 T.O.P, 找不到進化資訊: http://zh.tos.wikia.com/wiki/614
// No. 615 G-Dragon, 找不到進化資訊: http://zh.tos.wikia.com/wiki/615
// No. 619 搗藥兔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/619
// No. 620 超獸魔神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/620
{436 : 437},
// No. 636 式神 ‧ 大鯢鬼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/636
// No. 637 式神 ‧ 焚泣女, 找不到進化資訊: http://zh.tos.wikia.com/wiki/637
// No. 638 式神 ‧ 夜刀神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/638
// No. 639 式神 ‧ 善童鬼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/639
// No. 640 式神 ‧ 妙童鬼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/640
{434 : 435},
{436 : 437},
// No. 646 機械工程兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/646
// No. 647 蒸氣火力手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/647
// No. 648 機械醫護兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/648
// No. 649 機械後勤兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/649
{443 : 566},
// No. 650 蒸氣突擊手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/650
// No. 661 冰霜魔像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/661
{444 : 567},
{445 : 568},
// No. 662 天火魔像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/662
// No. 663 枯木魔像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/663
// No. 664 華光魔像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/664
// No. 665 無夜魔像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/665
{446 : 569},
{447 : 570},
// No. 672 南瓜三人組, 找不到進化資訊: http://zh.tos.wikia.com/wiki/672
{450 : 1188},
{57 : 451},
{59 : 452},
{61 : 453},
{65 : 455},
{63 : 454},
{87 : 456},
{89 : 457},
{93 : 459},
{91 : 458},
{107 : 461},
{95 : 460},
{109 : 462},
{111 : 463},
{113 : 464},
{115 : 465},
{466 : 467},
{466 : 467},
{467 : 711},
{468 : 469},
{468 : 469},
{469 : 712},
{470 : 471},
{470 : 471},
{471 : 713},
{472 : 473},
{474 : 475},
{472 : 473},
{473 : 714},
{474 : 475},
{475 : 715},
// No. 479 沉思的賢者 ‧ 山特古羅斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/479
{118 : 481},
{121 : 482},
{124 : 483},
{127 : 484},
{130 : 485},
{486 : 581},
{487 : 582},
{488 : 583},
{489 : 584},
{490 : 585},
{497 : 498},
{499 : 500},
{497 : 498},
{499 : 500},
{501 : 743},
// No. 502 覓果幻獸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/502
// No. 503 原始滄龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/503
// No. 504 魅果精靈, 找不到進化資訊: http://zh.tos.wikia.com/wiki/504
// No. 505 審判魔人, 找不到進化資訊: http://zh.tos.wikia.com/wiki/505
// No. 691 雨僮, 找不到進化資訊: http://zh.tos.wikia.com/wiki/691
{202 : 506},
{506 : 1022},
{506 : 1022},
{506 : 1022},
{506 : 1022},
// No. 692 輪入道, 找不到進化資訊: http://zh.tos.wikia.com/wiki/692
{204 : 507},
{507 : 1024},
{507 : 1024},
{507 : 1024},
{507 : 1024},
{206 : 508},
{508 : 1026},
{508 : 1026},
{508 : 1026},
{508 : 1026},
// No. 693 座敷童子, 找不到進化資訊: http://zh.tos.wikia.com/wiki/693
{208 : 509},
{509 : 1028},
{509 : 1028},
{509 : 1028},
{509 : 1028},
{210 : 510},
{510 : 1030},
{510 : 1030},
{510 : 1030},
{510 : 1030},
{24 : 511},
{28 : 512},
{32 : 513},
{36 : 514},
{40 : 515},
// No. 519 生命之光 ‧ 伊施妲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/519
// No. 694 豆腐小僧, 找不到進化資訊: http://zh.tos.wikia.com/wiki/694
{521 : 522},
{522 : 1661},
{521 : 522},
{523 : 524},
{523 : 524},
{524 : 1662},
{525 : 526},
{525 : 526},
{526 : 1663},
{527 : 528},
{527 : 528},
{528 : 1664},
{529 : 530},
// No. 695 二口女, 找不到進化資訊: http://zh.tos.wikia.com/wiki/695
{531 : 532},
{531 : 532},
{532 : 1041},
{533 : 534},
// No. 696 溪流水虎 ‧ 河童, 找不到進化資訊: http://zh.tos.wikia.com/wiki/696
{533 : 534},
{534 : 1042},
{535 : 536},
// No. 697 守門鬼 ‧ 茨木童子, 找不到進化資訊: http://zh.tos.wikia.com/wiki/697
// No. 698 深山鬼婆 ‧ 山姥, 找不到進化資訊: http://zh.tos.wikia.com/wiki/698
{537 : 538},
{537 : 538},
{538 : 1044},
{539 : 540},
{529 : 530},
{530 : 1665},
{539 : 540},
{540 : 1045},
// No. 541 傀儡仙童, 找不到進化資訊: http://zh.tos.wikia.com/wiki/541
// No. 699 落頭氏 ‧ 轆轤首, 找不到進化資訊: http://zh.tos.wikia.com/wiki/699
// No. 700 奪瞳妖 ‧ 百目鬼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/700
{535 : 536},
{536 : 1043},
{403 : 706},
{404 : 707},
{405 : 708},
{406 : 709},
{407 : 710},
{551 : 552},
{553 : 554},
{555 : 556},
{557 : 558},
{559 : 560},
// No. 744 鱗光青鯉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/744
{310 : 571},
{312 : 572},
{314 : 573},
{316 : 574},
{318 : 575},
{401 : 588},
{402 : 589},
{222 : 591},
{591 : 1082},
{591 : 1082},
{591 : 1082},
{591 : 1082},
{224 : 592},
{592 : 1084},
{592 : 1084},
{592 : 1084},
{592 : 1084},
{226 : 593},
{593 : 1086},
{593 : 1086},
{593 : 1086},
{593 : 1086},
{228 : 594},
{594 : 1088},
{594 : 1088},
{594 : 1088},
{594 : 1088},
{230 : 595},
{595 : 1090},
{595 : 1090},
{595 : 1090},
{595 : 1090},
{596 : 597},
{596 : 1366},
{596 : 597},
{598 : 599},
{598 : 1367},
{598 : 599},
{600 : 601},
{600 : 1368},
{600 : 601},
{602 : 603},
{602 : 1369},
{602 : 603},
{604 : 605},
{604 : 1370},
{604 : 605},
// No. 617 人面雛鳥, 找不到進化資訊: http://zh.tos.wikia.com/wiki/617
// No. 618 太陰星君 ‧ 常羲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/618
{621 : 622},
{621 : 622},
{622 : 623},
{622 : 623},
{623 : 1321},
{624 : 625},
{624 : 625},
{625 : 626},
{625 : 626},
{626 : 1322},
{627 : 628},
{627 : 628},
{628 : 629},
{628 : 629},
{629 : 1323},
{630 : 631},
{630 : 631},
{631 : 632},
{631 : 632},
{632 : 1324},
{633 : 634},
{633 : 634},
{634 : 635},
{634 : 635},
{635 : 1325},
{212 : 641},
{641 : 1381},
{641 : 1381},
{641 : 1381},
{641 : 1381},
{214 : 642},
{642 : 1383},
{642 : 1383},
{642 : 1383},
{642 : 1383},
{216 : 643},
{643 : 1385},
{643 : 1385},
{643 : 1385},
{643 : 1385},
{218 : 644},
{644 : 1387},
{644 : 1387},
{644 : 1387},
{644 : 1387},
{220 : 645},
{645 : 1389},
{645 : 1389},
{645 : 1389},
{645 : 1389},
// No. 771 琥珀, 找不到進化資訊: http://zh.tos.wikia.com/wiki/771
// No. 651 戰鯨 ‧ 摩斯路, 找不到進化資訊: http://zh.tos.wikia.com/wiki/651
// No. 772 小黃龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/772
// No. 652 戰翼 ‧ 薇薇爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/652
// No. 653 戰兵 ‧ 毒刺, 找不到進化資訊: http://zh.tos.wikia.com/wiki/653
// No. 654 戰偶 ‧ 皮諾曹, 找不到進化資訊: http://zh.tos.wikia.com/wiki/654
// No. 655 戰巫 ‧ 傑佩諾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/655
// No. 775 安卡, 找不到進化資訊: http://zh.tos.wikia.com/wiki/775
// No. 656 格蕾琴與海森堡 ‧ 戰鯨吐息, 找不到進化資訊: http://zh.tos.wikia.com/wiki/656
// No. 657 阿涅茜 ‧ 龍焰吞噬, 找不到進化資訊: http://zh.tos.wikia.com/wiki/657
// No. 658 蠻牛貳式 ‧ 蜂翼炮擊, 找不到進化資訊: http://zh.tos.wikia.com/wiki/658
// No. 659 莉莎 ‧ 聖魔脈衝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/659
// No. 773 阿奇, 找不到進化資訊: http://zh.tos.wikia.com/wiki/773
// No. 774 子大暑, 找不到進化資訊: http://zh.tos.wikia.com/wiki/774
// No. 776 寒冰魔將 ‧ 藍魔神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/776
// No. 777 烈焰魔將 ‧ 姆斯比爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/777
// No. 778 奇門遁甲 ‧ 機關人, 找不到進化資訊: http://zh.tos.wikia.com/wiki/778
// No. 781 魔女轉世 ‧ 妮可, 找不到進化資訊: http://zh.tos.wikia.com/wiki/781
// No. 779 護教騎士 ‧ 麥爾斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/779
// No. 782 鬼神之瞳 ‧ 鳳天凌, 找不到進化資訊: http://zh.tos.wikia.com/wiki/782
// No. 660 米基利 ‧ 鋼蛇咬噬, 找不到進化資訊: http://zh.tos.wikia.com/wiki/660
// No. 666 冰耀獸神兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/666
// No. 667 天火龍神兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/667
// No. 668 碧青靈神兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/668
// No. 669 聖靈巨神兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/669
// No. 780 魔軀靈心 ‧ 獨孤寧珂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/780
// No. 448 符靈典範 ‧ 綠茵國王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/448
// No. 670 無夜魔神兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/670
// No. 673 骸骨巫妖, 找不到進化資訊: http://zh.tos.wikia.com/wiki/673
{286 : 674},
// No. 675 巨星之靈, 找不到進化資訊: http://zh.tos.wikia.com/wiki/675
{676 : 677},
{676 : 677},
{678 : 679},
{678 : 679},
{680 : 681},
{680 : 681},
{682 : 683},
{682 : 683},
{684 : 685},
{684 : 685},
{133 : 686},
{136 : 687},
{139 : 688},
// No. 496 魔境之主 ‧ 紅心女王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/496
{142 : 689},
{145 : 690},
// No. 800 迷你瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/800
// No. 542 三清祖師 ‧ 元始天尊, 找不到進化資訊: http://zh.tos.wikia.com/wiki/542
// No. 701 輝日之聖魂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/701
// No. 702 皎月之聖魄, 找不到進化資訊: http://zh.tos.wikia.com/wiki/702
{289 : 704},
{288 : 703},
// No. 705 怪盜黑手黨 ‧ 史古基, 找不到進化資訊: http://zh.tos.wikia.com/wiki/705
{467 : 711},
{711 : 1327},
{711 : 1327},
{711 : 1327},
{711 : 1327},
{469 : 712},
{712 : 1329},
{712 : 1329},
{712 : 1329},
{712 : 1329},
{471 : 713},
{713 : 1331},
{713 : 1331},
{713 : 1331},
{713 : 1331},
{473 : 714},
{714 : 1333},
{714 : 1333},
{714 : 1333},
{714 : 1333},
{475 : 715},
{715 : 1335},
{715 : 1335},
{715 : 1335},
{715 : 1335},
// No. 716 復仇半龍 ‧ 絲蔻比亞, 找不到進化資訊: http://zh.tos.wikia.com/wiki/716
// No. 718 嫉愛薔薇 ‧ 艾摩婭與瑟露絲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/718
// No. 717 執拗聖盾 ‧ 忒提斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/717
// No. 720 魔骸戰意 ‧ 呂凌霜, 找不到進化資訊: http://zh.tos.wikia.com/wiki/720
// No. 719 鬼刀意志 ‧ 今劍與薄綠, 找不到進化資訊: http://zh.tos.wikia.com/wiki/719
// No. 721 仇龍英雄 ‧ 貝奧武夫, 找不到進化資訊: http://zh.tos.wikia.com/wiki/721
// No. 722 桀驁戰神 ‧ 阿基里斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/722
// No. 723 嫉愛雙槍 ‧ 迪爾姆德, 找不到進化資訊: http://zh.tos.wikia.com/wiki/723
// No. 724 鬼面魔刃 ‧ 源義經, 找不到進化資訊: http://zh.tos.wikia.com/wiki/724
{726 : 727},
{727 : 1126},
{726 : 727},
// No. 725 魔骸神將 ‧ 王鬼呂布, 找不到進化資訊: http://zh.tos.wikia.com/wiki/725
{728 : 729},
{728 : 729},
{729 : 1127},
{730 : 731},
{732 : 733},
{733 : 1129},
// No. 543 靈寶天尊 ‧ 通天教主, 找不到進化資訊: http://zh.tos.wikia.com/wiki/543
{730 : 731},
{731 : 1128},
{732 : 733},
{734 : 735},
// No. 561 奈亞拉托提普, 找不到進化資訊: http://zh.tos.wikia.com/wiki/561
{734 : 735},
{735 : 1130},
// No. 736 青行燈, 找不到進化資訊: http://zh.tos.wikia.com/wiki/736
// No. 562 黃衣魅影 ‧ 哈斯塔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/562
{287 : 739},
{739 : 1310},
// No. 738 薨志神賢, 找不到進化資訊: http://zh.tos.wikia.com/wiki/738
// No. 740 獨酌酒神 ‧ 泰奧尼修斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/740
// No. 741 煉獄恐靈, 找不到進化資訊: http://zh.tos.wikia.com/wiki/741
{285 : 742},
{501 : 743},
{746 : 747},
{746 : 747},
{748 : 749},
{750 : 751},
{748 : 749},
{750 : 751},
// No. 811 半人英雄 ‧ 俄安內, 找不到進化資訊: http://zh.tos.wikia.com/wiki/811
// No. 812 善惡火神 ‧ 吉比爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/812
// No. 813 豐收與知識女神 ‧ 尼沙巴, 找不到進化資訊: http://zh.tos.wikia.com/wiki/813
// No. 814 眾生之母 ‧ 寧胡爾薩格, 找不到進化資訊: http://zh.tos.wikia.com/wiki/814
// No. 815 冥府守門者 ‧ 涅蒂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/815
{579 : 1017},
{580 : 1079},
{752 : 753},
{752 : 753},
// No. 590 道德天尊 ‧ 太上老君, 找不到進化資訊: http://zh.tos.wikia.com/wiki/590
{754 : 755},
{756 : 757},
{754 : 755},
{756 : 757},
{758 : 759},
{758 : 759},
{760 : 761},
{760 : 761},
{762 : 763},
{762 : 763},
{764 : 765},
{764 : 765},
// No. 616 龍傲影控師, 找不到進化資訊: http://zh.tos.wikia.com/wiki/616
{766 : 767},
{766 : 767},
// No. 783 符鬼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/783
{784 : 785},
{833 : 834},
{831 : 832},
{833 : 834},
{835 : 836},
{835 : 836},
{839 : 840},
{837 : 838},
{837 : 838},
// No. 841 大荒神 建速須佐之男命, 找不到進化資訊: http://zh.tos.wikia.com/wiki/841
// No. 842 炎光神 天照大神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/842
// No. 844 天后 媽祖, 找不到進化資訊: http://zh.tos.wikia.com/wiki/844
// No. 843 八岐的牲禮公主 櫛名田, 找不到進化資訊: http://zh.tos.wikia.com/wiki/843
// No. 845 月想女神 月讀, 找不到進化資訊: http://zh.tos.wikia.com/wiki/845
// No. 847 神帝史特萊克, 找不到進化資訊: http://zh.tos.wikia.com/wiki/847
{784 : 785},
{839 : 840},
{786 : 787},
// No. 846 恐龍王雷奇利德, 找不到進化資訊: http://zh.tos.wikia.com/wiki/846
{786 : 787},
{788 : 789},
{788 : 789},
// No. 671 純真屠夫 ‧ 艾德, 找不到進化資訊: http://zh.tos.wikia.com/wiki/671
{790 : 791},
{791 : 1181},
{790 : 791},
{792 : 793},
{792 : 793},
{793 : 1182},
// No. 856 無心械軀, 找不到進化資訊: http://zh.tos.wikia.com/wiki/856
{794 : 795},
{794 : 795},
{795 : 1183},
{796 : 797},
{797 : 1184},
{796 : 797},
{798 : 799},
// No. 857 溫琪女巫, 找不到進化資訊: http://zh.tos.wikia.com/wiki/857
// No. 858 稻草愚者, 找不到進化資訊: http://zh.tos.wikia.com/wiki/858
// No. 860 憂懼獅獸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/860
// No. 859 托托, 找不到進化資訊: http://zh.tos.wikia.com/wiki/859
{798 : 799},
{799 : 1185},
// No. 872 鐵皮小豬騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/872
// No. 871 鐵皮小鴨騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/871
{801 : 802},
// No. 873 鐵皮羊駝騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/873
{803 : 804},
{801 : 802},
{802 : 1216},
{803 : 804},
{804 : 1217},
// No. 874 鐵皮蜂鳥騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/874
// No. 875 鐵皮章魚騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/875
{805 : 806},
{805 : 806},
{806 : 1218},
{807 : 808},
// No. 737 道摩法師 ‧ 蘆屋道滿, 找不到進化資訊: http://zh.tos.wikia.com/wiki/737
// No. 745 軒轅劍客 ‧ 何然, 找不到進化資訊: http://zh.tos.wikia.com/wiki/745
{807 : 808},
{808 : 1219},
{809 : 810},
{809 : 810},
{810 : 1220},
// No. 879 獨角仙君, 找不到進化資訊: http://zh.tos.wikia.com/wiki/879
{356 : 816},
{358 : 817},
{360 : 818},
{362 : 819},
{366 : 821},
{364 : 820},
// No. 769 魯班一脈 ‧ 黃雷, 找不到進化資訊: http://zh.tos.wikia.com/wiki/769
// No. 768 遺恨忠烈 ‧ 魔化陳輔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/768
{368 : 822},
{370 : 823},
// No. 770 靈天之首 ‧ 姬克, 找不到進化資訊: http://zh.tos.wikia.com/wiki/770
{372 : 824},
{374 : 825},
{376 : 826},
{378 : 827},
// No. 828 守靈戰偶 ‧ 拉帕努伊, 找不到進化資訊: http://zh.tos.wikia.com/wiki/828
{829 : 1716},
{831 : 832},
// No. 849 怨靈古木, 找不到進化資訊: http://zh.tos.wikia.com/wiki/849
{290 : 850},
{178 : 851},
{181 : 852},
{187 : 854},
{184 : 853},
{190 : 855},
{861 : 862},
{862 : 1191},
{861 : 862},
{863 : 864},
{863 : 864},
{864 : 1192},
{865 : 866},
{866 : 1193},
{865 : 866},
{867 : 868},
{867 : 868},
{868 : 1194},
{869 : 870},
{869 : 870},
{870 : 1195},
// No. 877 永恆守候 · 牛郎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/877
{881 : 882},
{882 : 1266},
{881 : 882},
{883 : 884},
{884 : 1267},
{883 : 884},
{885 : 886},
{885 : 886},
{886 : 1268},
{887 : 888},
{887 : 888},
{888 : 1269},
{889 : 890},
{890 : 1270},
{889 : 890},
{891 : 892},
{891 : 892},
{893 : 894},
{893 : 894},
{895 : 896},
{895 : 896},
// No. 830 千知賢者 ‧ 加諾奧斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/830
{897 : 898},
{897 : 898},
{899 : 900},
{899 : 900},
// No. 848 黃泉津大神 伊邪那美, 找不到進化資訊: http://zh.tos.wikia.com/wiki/848
{901 : 902},
{901 : 902},
{903 : 904},
{903 : 904},
{905 : 906},
{905 : 906},
{907 : 908},
{907 : 908},
{909 : 910},
{909 : 910},
{911 : 912},
{911 : 912},
// No. 876 精靈使 ‧ 烏特博麗公主, 找不到進化資訊: http://zh.tos.wikia.com/wiki/876
{913 : 914},
// No. 878 念郎仙子 · 織女, 找不到進化資訊: http://zh.tos.wikia.com/wiki/878
// No. 880 機動要塞 · 斯特靈, 找不到進化資訊: http://zh.tos.wikia.com/wiki/880
{913 : 914},
{915 : 916},
{915 : 916},
// No. 917 白苗巫女 ‧ 阿奴, 找不到進化資訊: http://zh.tos.wikia.com/wiki/917
{919 : 920},
{919 : 920},
// No. 921 不撓武道 ‧ 王小虎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/921
{564 : 979},
// No. 922 蜀門半妖 ‧ 南宮煌, 找不到進化資訊: http://zh.tos.wikia.com/wiki/922
// No. 923 望舒射日 ‧ 雲天河, 找不到進化資訊: http://zh.tos.wikia.com/wiki/923
// No. 925 瑾中伊人 ‧ 瑕, 找不到進化資訊: http://zh.tos.wikia.com/wiki/925
// No. 924 翰墨丹青 ‧ 夏侯瑾軒, 找不到進化資訊: http://zh.tos.wikia.com/wiki/924
{926 : 927},
// No. 1001 藍霜巨人 ‧ 絲卡蒂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1001
// No. 1002 赤岩巨人 ‧ 赫朗格尼爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1002
// No. 1003 青羽巨人 ‧ 夏基, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1003
// No. 1004 璃電巨人 ‧ 法布提, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1004
// No. 1005 紫髏巨人 ‧ 尤彌爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1005
// No. 918 屍身妖王 ‧ 星璇, 找不到進化資訊: http://zh.tos.wikia.com/wiki/918
{926 : 927},
{928 : 929},
{928 : 929},
{930 : 931},
{930 : 931},
{932 : 933},
{934 : 935},
{934 : 935},
// No. 936 軟星包子, 找不到進化資訊: http://zh.tos.wikia.com/wiki/936
// No. 1050 魔源繼主 ‧ 奧茲瑪, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1050
// No. 1051 饑荒騎士 ‧ 芭婭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1051
// No. 1052 屠殺騎士 ‧ 貝爾賽克, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1052
// No. 1053 瘟疫騎士 ‧ 塞普勒斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1053
// No. 1054 災厄騎士 ‧ 畢夏普, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1054
// No. 1055 衰老騎士 ‧ 奈普, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1055
// No. 1071 伊恩 ‧ 克利夫, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1071
// No. 1075 諾維雅 ‧ 克利夫, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1075
{192 : 941},
{941 : 1357},
{941 : 1357},
{941 : 1357},
{941 : 1357},
{194 : 942},
{942 : 1359},
{942 : 1359},
{942 : 1359},
{942 : 1359},
{198 : 944},
{944 : 1363},
{944 : 1363},
{944 : 1363},
{944 : 1363},
{196 : 943},
{943 : 1361},
{943 : 1361},
{943 : 1361},
{943 : 1361},
{200 : 945},
{945 : 1365},
{945 : 1365},
{945 : 1365},
{945 : 1365},
{946 : 947},
{946 : 947},
{947 : 1261},
{932 : 933},
// No. 1099 多端幻變 ‧ 貓又, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1099
{948 : 949},
{948 : 949},
{949 : 1262},
{950 : 951},
{950 : 951},
{951 : 1263},
{1111 : 1112},
{1111 : 1112},
{952 : 953},
{1113 : 1114},
{952 : 953},
{953 : 1264},
{1113 : 1114},
{1115 : 1116},
{1115 : 1116},
{1117 : 1118},
{1117 : 1118},
{1119 : 1120},
// No. 1121 冰棘水龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1121
{1119 : 1120},
// No. 1122 翼火王龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1122
// No. 1123 朽蟲化龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1123
// No. 1124 磷光骨龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1124
// No. 1125 古鱗魔龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1125
{954 : 955},
{954 : 955},
{955 : 1265},
{1146 : 1147},
{1148 : 1149},
// No. 956 墮落之羽 ‧ 憂懼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/956
{1150 : 1151},
// No. 957 墮落之羽 ‧ 衝動, 找不到進化資訊: http://zh.tos.wikia.com/wiki/957
// No. 958 墮落之羽 ‧ 溺愛, 找不到進化資訊: http://zh.tos.wikia.com/wiki/958
// No. 959 墮落之羽 ‧ 自負, 找不到進化資訊: http://zh.tos.wikia.com/wiki/959
// No. 960 墮落之羽 ‧ 冷漠, 找不到進化資訊: http://zh.tos.wikia.com/wiki/960
{1152 : 1153},
{1154 : 1155},
// No. 1156 子夜藍嬰, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1156
// No. 1157 辮子姑娘, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1157
// No. 1158 天蛾人, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1158
// No. 1159 斬人賓尼兔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1159
// No. 1160 小丑雕像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1160
// No. 1162 嫉妒異教教主, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1162
// No. 961 憂懼之罪 ‧ 梅塔特隆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/961
// No. 963 溺愛之罪 ‧ 梅塔特隆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/963
// No. 962 衝動之罪 ‧ 梅塔特隆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/962
// No. 1176 冰海霸王 ‧ 萊夫, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1176
// No. 1177 紅色骷髏 ‧ 埃里克, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1177
// No. 1178 毒霧蜘蛛 ‧ 安妮, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1178
// No. 1179 秘寶收藏家 ‧ 張保仔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1179
// No. 964 自負之罪 ‧ 梅塔特隆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/964
{966 : 967},
// No. 965 冷漠之罪 ‧ 梅塔特隆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/965
{966 : 967},
// No. 1199 祝願海蝶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1199
// No. 1200 千日瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1200
// No. 1201 逗趣童心 ‧ 金貝貝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1201
// No. 1202 嬌蠻皇女 ‧ 莎拉公主, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1202
// No. 1203 狡詐賭王 ‧ 大老千, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1203
// No. 1204 暴富酋長 ‧ 沙隆巴斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1204
// No. 1206 善心智多星 ‧ 孫小美, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1206
// No. 1205 謎之黑影 ‧ 忍太郎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1205
// No. 1207 樂天老頭 ‧ 阿土伯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1207
// No. 1208 股市女神 ‧ 錢夫人, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1208
// No. 1209 時來運到 ‧ 福神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1209
// No. 1210 窮也窮開心 ‧ 窮神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1210
// No. 1211 財源滾滾 ‧ 財神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1211
// No. 1212 蒜你倒霉 ‧ 衰神, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1212
{968 : 969},
{968 : 969},
// No. 1231 深海野孩 ‧ 海豆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1231
// No. 1232 獸心獵女 ‧ 阿格麗, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1232
// No. 1233 蛇妖術士 ‧ 御鬼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1233
// No. 1234 野獸之聲 ‧ 歡歡, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1234
// No. 1235 拜金獵手 ‧ 銀丸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1235
{970 : 971},
{970 : 971},
{972 : 973},
{972 : 973},
// No. 1256 魔笛, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1256
// No. 1257 淚紅傘, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1257
// No. 1259 閃靈照相機, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1259
// No. 1258 宿怨鳥籠, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1258
{974 : 975},
{974 : 975},
// No. 1260 纏身人偶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1260
// No. 977 繽果調飲師 ‧ 仙杜麗拉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/977
// No. 978 月宮聖後 ‧ 嫦娥, 找不到進化資訊: http://zh.tos.wikia.com/wiki/978
// No. 1271 弓弩手, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1271
// No. 1273 刀盾兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1273
// No. 1272 鋼槍兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1272
{980 : 981},
// No. 1274 鐵騎兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1274
// No. 1275 妖術士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1275
{980 : 981},
{982 : 983},
{982 : 983},
// No. 1297 羽扇綸巾 ‧ 周瑜, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1297
{984 : 985},
{984 : 985},
{986 : 987},
{986 : 987},
{987 : 1311},
{988 : 989},
{989 : 1312},
{988 : 989},
// No. 1299 道賀信天翁, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1299
{990 : 991},
// No. 1301 水動戰軀 ‧ 潘琪, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1301
// No. 1300 派對瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1300
// No. 1302 瘋狂武裝 ‧ 法拉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1302
// No. 1303 神蹟追蹤 ‧ 菲凱倫, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1303
// No. 1304 復仇理論 ‧ 桑芝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1304
// No. 1305 血色子彈 ‧ 麥卡蒂, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1305
{990 : 991},
{991 : 1313},
{992 : 993},
{992 : 993},
{993 : 1314},
{994 : 995},
{995 : 1315},
{994 : 995},
// No. 997 誓約燭焰, 找不到進化資訊: http://zh.tos.wikia.com/wiki/997
{293 : 998},
// No. 999 瘋頭劍仙, 找不到進化資訊: http://zh.tos.wikia.com/wiki/999
// No. 1000 瘋頭劍聖, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1000
{1006 : 1007},
{1007 : 1411},
{1006 : 1007},
{1008 : 1009},
{1008 : 1009},
{1009 : 1412},
{1010 : 1011},
{1010 : 1011},
{1011 : 1413},
{1012 : 1013},
{1012 : 1013},
{1013 : 1414},
{1014 : 1015},
{1014 : 1015},
{1015 : 1415},
// No. 1016 雷霆神像, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1016
// No. 1018 無頭騎士 ‧ 杜拉漢, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1018
// No. 1019 雪球四分衛 ‧ 雪高, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1019
{1565 : 1346},
{1565 : 1347},
{1022 : 1021},
{1565 : 1348},
{1565 : 1350},
{506 : 1022},
{1024 : 1023},
{1026 : 1025},
{507 : 1024},
{508 : 1026},
{1028 : 1027},
{509 : 1028},
{1030 : 1029},
{1372 : 1371},
{1374 : 1373},
{510 : 1030},
{1031 : 1032},
{1031 : 1032},
{1032 : 1406},
{1033 : 1034},
{1033 : 1034},
{1034 : 1407},
{1035 : 1036},
{1035 : 1036},
{1036 : 1408},
{1037 : 1038},
{1037 : 1038},
{1038 : 1409},
{1039 : 1040},
{1040 : 1410},
{1039 : 1040},
// No. 1399 台式瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1399
// No. 1402 銀瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1402
// No. 1400 港式瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1400
// No. 1401 銅瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1401
// No. 1403 金瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1403
{532 : 1041},
{534 : 1042},
{536 : 1043},
{538 : 1044},
{540 : 1045},
// No. 937 羲和宿主 ‧ 玄霄, 找不到進化資訊: http://zh.tos.wikia.com/wiki/937
{345 : 1046},
{347 : 1047},
{349 : 1048},
{1056 : 1057},
{1056 : 1057},
{1057 : 1336},
{1058 : 1059},
{1058 : 1059},
{1059 : 1337},
{1060 : 1061},
{1060 : 1061},
{1061 : 1338},
// No. 938 魔尊 ‧ 重樓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/938
// No. 940 夜叉謀士 ‧ 魔翳, 找不到進化資訊: http://zh.tos.wikia.com/wiki/940
// No. 939 大祭司 ‧ 拜月教主, 找不到進化資訊: http://zh.tos.wikia.com/wiki/939
{1062 : 1063},
{1062 : 1063},
{1063 : 1339},
{1064 : 1065},
{1064 : 1065},
{1065 : 1340},
{414 : 1066},
{416 : 1067},
{418 : 1068},
{422 : 1070},
{420 : 1069},
// No. 1072 愛葛莎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1072
// No. 1076 傳頌靈碑, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1076
// No. 1078 冥蟲頭甲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1078
// No. 1080 姻緣牽線 ‧ 月老, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1080
{1082 : 1081},
{591 : 1082},
{1084 : 1083},
{592 : 1084},
{1086 : 1085},
{593 : 1086},
{1088 : 1087},
{594 : 1088},
{1090 : 1089},
{595 : 1090},
// No. 1091 水精靈仙女 忒琪菈, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1091
// No. 1092 炎輝神 雅格娜姆特, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1092
// No. 1093 妖精皇 闇黑基姆雷特, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1093
// No. 1094 騎士王亞瑟, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1094
// No. 1095 頹廢的黑薔薇 赫拉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1095
// No. 1096 世界樹神 尤克特拉希爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1096
// No. 1097 反叛的墮天使 路西法, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1097
// No. 1439 創曆者 ‧ 瑪雅, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1439
// No. 1440 生死胡狼 ‧ 阿努比斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1440
// No. 1441 拳擊盾步兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1441
// No. 1442 佩劍步兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1442
// No. 1443 長柄步兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1443
// No. 1444 傳令步兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1444
// No. 1445 十字弓步兵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1445
{1101 : 1102},
{1101 : 1102},
{1102 : 1351},
{1103 : 1104},
{1103 : 1104},
{1104 : 1352},
{1105 : 1106},
{1105 : 1106},
{1106 : 1353},
{1107 : 1108},
{1109 : 1110},
{1109 : 1110},
{1110 : 1355},
// No. 1462 叛逆帝王 ‧ 莫德雷德, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1462
// No. 1467 眩目之光 ‧ 亞弗戈蒙, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1467
// No. 1468 二刀武痴 ‧ 宮本武藏, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1468
// No. 1469 無憂武士 ‧ 小次郎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1469
// No. 1470 藏真忍士 ‧ 服部半藏, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1470
// No. 1491 燈火宵行 ‧ 秀太, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1491
// No. 1490 跋扈狂獸 ‧ 武田信玄, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1490
// No. 1495 孤虎連舞 ‧ 井伊直虎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1495
// No. 1496 炎樂舞姬 ‧ 靜御前, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1496
// No. 1497 夜櫻紛飛之嵐 ‧ 黃泉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1497
// No. 1500 神魔小妹, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1500
{1107 : 1108},
{1108 : 1354},
// No. 1501 書生布偶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1501
// No. 1503 長眉仙偶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1503
// No. 1502 炎令布偶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1502
// No. 1504 執扇布偶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1504
// No. 1505 指花女偶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1505
{727 : 1126},
{729 : 1127},
{733 : 1129},
{735 : 1130},
{731 : 1128},
// No. 1131 索布兔騎士 ‧ 摩艾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1131
// No. 1135 渾天原始神卡俄斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1135
{1136 : 1137},
{1136 : 1137},
{1137 : 1375},
// No. 1514 道教頂峰 ‧ 劍子仙跡, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1514
{1138 : 1139},
{1138 : 1139},
{1139 : 1376},
{1140 : 1141},
{1140 : 1141},
{1141 : 1377},
{1142 : 1143},
{1142 : 1143},
{1143 : 1378},
{1144 : 1145},
{1144 : 1145},
{1145 : 1379},
{1146 : 1147},
{1148 : 1149},
// No. 1515 儒門龍首 ‧ 疏樓龍宿, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1515
// No. 1516 聖行者 ‧ 佛劍分說, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1516
// No. 1520 六絃之首 ‧ 蒼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1520
// No. 1522 日月巨狼 ‧ 芬爾厄, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1522
{1150 : 1151},
{354 : 1525},
// No. 1524 闇黑小妹, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1524
// No. 1527 赤盔大地精, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1527
// No. 1526 冰盔大地精, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1526
// No. 1529 耀盔大地精, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1529
// No. 1528 碧盔大地精, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1528
{1152 : 1153},
// No. 1530 闇盔大地精, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1530
{1154 : 1155},
// No. 1161 時尚洪流 ‧ 雨依, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1161
// No. 1531 冰藍愛莉絲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1531
// No. 1532 赤紅瑪莉曼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1532
// No. 1533 翠綠凱莉絲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1533
// No. 1166 冰花, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1166
// No. 1167 明鏡之諜 ‧ 冰花, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1167
// No. 1534 金光安迪莉亞, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1534
// No. 1535 艷紫莉莉絲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1535
// No. 1168 洛可可, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1168
// No. 1171 拳風療動 ‧ 新月, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1171
// No. 1169 堅守赤心 ‧ 洛可可, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1169
// No. 1170 新月, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1170
// No. 1172 摩斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1172
// No. 1173 思考殿主 ‧ 摩斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1173
// No. 1174 優格圖, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1174
// No. 1175 漆黑啟示 ‧ 優格圖, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1175
// No. 1180 大海羅賓漢 ‧ 薩姆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1180
{791 : 1181},
{793 : 1182},
{795 : 1183},
{799 : 1185},
// No. 1186 馴獸師 ‧ 寶寶, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1186
// No. 1187 法則天秤, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1187
{450 : 1188},
{1189 : 1372},
{1189 : 1372},
{864 : 1192},
{1190 : 1374},
{1190 : 1374},
{862 : 1191},
{797 : 1184},
{866 : 1193},
{868 : 1194},
{870 : 1195},
// No. 1215 黑貓摩托車 ‧ 十月三十, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1215
{802 : 1216},
{808 : 1219},
{804 : 1217},
{806 : 1218},
{810 : 1220},
{1221 : 1222},
{1221 : 1222},
{1223 : 1224},
{1223 : 1224},
{1225 : 1226},
{1225 : 1226},
{1227 : 1228},
{1227 : 1228},
{1229 : 1230},
{1229 : 1230},
{1236 : 1237},
{1236 : 1237},
{1238 : 1239},
{1240 : 1241},
{1238 : 1239},
{1240 : 1241},
{1242 : 1243},
{1242 : 1243},
{1244 : 1245},
{1244 : 1245},
{1246 : 1247},
{1246 : 1247},
{1248 : 1249},
{1248 : 1249},
{1250 : 1251},
{1250 : 1251},
// No. 976 星辰之翼 ‧ 梅塔特隆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/976
{947 : 1261},
{951 : 1263},
{949 : 1262},
// No. 1559 計算的善意‧ 長蛇座契布曼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1559
// No. 1560 善良的強大 ‧巨爵座柏克, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1560
// No. 1561 暗夜曙光 ‧ 烏鴉座卡蓮婭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1561
// No. 1562 弗麗嘉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1562
// No. 1563 眾心所牽 ‧ 凱拉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1563
// No. 1564 源生混沌 ‧ 倪克斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1564
// No. 1566 強拳少年, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1566
// No. 1567 暴走少女, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1567
// No. 1568 鐵拳漢子, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1568
// No. 1569 狼牙流氓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1569
// No. 1570 濃妝高中生, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1570
// No. 1581 八咫鏡之守護 ‧ 神樂千鶴, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1581
// No. 1582 閃靈狩獵 ‧ 克里斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1582
// No. 1583 終極衝殺 ‧ 七枷社, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1583
// No. 1584 重力旋投 ‧ 舍露美, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1584
// No. 1585 軍武傭兵 ‧ 莉安娜, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1585
// No. 1589 Terry, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1589
// No. 1588 致命糬兔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1588
// No. 1590 灼熱本能 ‧ K´, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1590
// No. 1591 瞬間凍結 ‧ 庫拉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1591
{953 : 1264},
{955 : 1265},
{882 : 1266},
// No. 1592 黑鐵凱爾文, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1592
// No. 1593 黑鐵沃爾特, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1593
{884 : 1267},
// No. 1594 黑鐵布賴恩, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1594
// No. 1595 黑鐵內森, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1595
// No. 1596 黑鐵亞歷克斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1596
// No. 1597 撲克國王 ‧ 派斯頓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1597
// No. 1598 撲克騎士 ‧ 奧吉爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1598
{886 : 1268},
{888 : 1269},
{890 : 1270},
// No. 1599 撲克女皇 ‧ 茱迪思, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1599
// No. 1600 袋中瘋頭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1600
{1276 : 1277},
{1276 : 1277},
{1278 : 1279},
{1278 : 1279},
{1282 : 1283},
{1280 : 1281},
{1282 : 1283},
{1284 : 1285},
{1284 : 1285},
{1286 : 1287},
{1286 : 1287},
{1288 : 1289},
{1280 : 1281},
{1290 : 1291},
{1288 : 1289},
{1290 : 1291},
// No. 1292 蒼生之龍 ‧ 趙雲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1292
// No. 1296 花千繡 ‧ 貂蟬, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1296
// No. 1298 幻筆師凱瑟琳, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1298
// No. 1294 飛瓣千金 ‧ 孫尚香, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1294
// No. 1306 鹿角組, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1306
// No. 1307 紅鼻組, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1307
// No. 1308 禮物黑手黨 ‧ 馴鹿組, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1308
{1310 : 1309},
// No. 1624 絲堤, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1624
{739 : 1310},
{989 : 1312},
// No. 1625 玩具怨念, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1625
{399 : 1627},
// No. 1628 忠貞不渝 ‧ 利維坦, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1628
{987 : 1311},
// No. 1629 狂妄傲氣 ‧ 貝爾芬格, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1629
// No. 1630 奪寶炫光 ‧ 瑪門, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1630
{991 : 1313},
// No. 996 龍血銳劍 ‧ 齊格菲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/996
{993 : 1314},
{995 : 1315},
{43 : 1316},
// No. 1631 賢者羊駝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1631
// No. 1632 鬥士羊駝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1632
// No. 1633 醫師羊駝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1633
{49 : 1318},
{46 : 1317},
{52 : 1319},
{55 : 1320},
// No. 1634 牧師羊駝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1634
{623 : 1321},
{626 : 1322},
{632 : 1324},
{629 : 1323},
{635 : 1325},
// No. 1635 舞者羊駝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1635
{1327 : 1326},
{711 : 1327},
{1329 : 1328},
{1331 : 1330},
{713 : 1331},
{1333 : 1332},
{1335 : 1334},
{714 : 1333},
{715 : 1335},
{1057 : 1336},
{712 : 1329},
{1059 : 1337},
{1063 : 1339},
{1065 : 1340},
{296 : 1341},
{299 : 1342},
{302 : 1343},
{305 : 1344},
{579 : 1017},
{308 : 1345},
{1061 : 1338},
// No. 1020 永生的詛咒 ‧ 羅伯特, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1020
{1102 : 1351},
{1104 : 1352},
{1108 : 1354},
{1106 : 1353},
// No. 1659 聖誕小妹, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1659
{1110 : 1355},
{1357 : 1356},
{941 : 1357},
{1359 : 1358},
{1361 : 1360},
{942 : 1359},
{1363 : 1362},
{943 : 1361},
// No. 1669 白髏屍魔 ‧ 白骨精, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1669
{944 : 1363},
{1365 : 1364},
{945 : 1365},
{596 : 1366},
{598 : 1367},
{600 : 1368},
{602 : 1369},
{604 : 1370},
{1189 : 1372},
{1190 : 1374},
{1137 : 1375},
{1139 : 1376},
{1143 : 1378},
{1141 : 1377},
{1145 : 1379},
{641 : 1380},
{641 : 1381},
{1383 : 1382},
{642 : 1383},
// No. 1693 萬人敵 ‧ 關師傅, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1693
// No. 1694 疾速機械劍齒虎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1694
{643 : 1385},
{644 : 1387},
{1387 : 1386},
{1389 : 1388},
{645 : 1389},
{1385 : 1384},
// No. 1404 鐵扇公主 ‧ 羅剎女, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1404
// No. 1405 聖賢哲者 ‧ 唐三藏, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1405
{1032 : 1406},
{1034 : 1407},
{1036 : 1408},
{1038 : 1409},
{1040 : 1410},
{1007 : 1411},
// No. 1697 虛擬人性 ‧ 耶魯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1697
// No. 1696 無感本心 ‧ 貝魯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1696
{1009 : 1412},
{1011 : 1413},
{1013 : 1414},
// No. 1698 璀璨遺光 ‧ 小呼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1698
{1015 : 1415},
{1416 : 1417},
{1416 : 1417},
{1418 : 1419},
// No. 1049 古樹神母 ‧ 希栢利, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1049
{1418 : 1419},
{1420 : 1421},
{1420 : 1421},
{1422 : 1423},
{1422 : 1423},
// No. 1074 黑騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1074
// No. 1077 誓約的象徵 ‧ 華爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1077
{580 : 1079},
{1424 : 1425},
// No. 1700 浮游幸福 ‧ 青郎君, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1700
// No. 1073 巴爾德爾 ‧ 克利夫, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1073
// No. 1702 傲骨仙蹤 ‧ 曹國舅, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1702
{1426 : 1427},
{1428 : 1429},
// No. 1707 玩心不盡 ‧ 韓湘子, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1707
{1428 : 1429},
{1430 : 1431},
{1430 : 1431},
{1424 : 1425},
// No. 1708 滄心童顏 ‧ 張果老, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1708
// No. 1709 燭龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1709
// No. 1434 一扇月 ‧ 輝夜姬, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1434
// No. 1435 金糧神 ‧ 大黑天, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1435
{1426 : 1427},
// No. 1438 白金美神 ‧ 維納斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1438
// No. 1098 倭男具那命 日本武尊, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1098
// No. 1100 復仇魔君 ‧ 貝利爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1100
// No. 1712 躍然紙上 ‧ 無名, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1712
{1446 : 1447},
{1446 : 1447},
{1448 : 1449},
{1448 : 1449},
{1450 : 1451},
{1450 : 1451},
{1452 : 1453},
{1452 : 1453},
{1454 : 1455},
// No. 1713 神來之筆 ‧ 春香, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1713
// No. 1714 妒犬搗蛋 ‧ 苟杳, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1714
{1454 : 1455},
{1456 : 1457},
{1456 : 1457},
{1458 : 1459},
{1460 : 1461},
{1458 : 1459},
{1460 : 1461},
// No. 1463 暴欲狂獅 ‧ 蘭馬洛克, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1463
// No. 1465 深淵魔女 ‧ 摩根勒菲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1465
// No. 1466 脫兔派對王 ‧ 君士坦丁, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1466
{1471 : 1472},
{1471 : 1472},
{1473 : 1474},
{1473 : 1474},
{1475 : 1476},
{1475 : 1476},
{1477 : 1478},
{1477 : 1478},
{1479 : 1480},
{1481 : 1482},
{1481 : 1482},
{1483 : 1484},
{1483 : 1484},
{1485 : 1486},
{1485 : 1486},
{1479 : 1480},
// No. 1489 戰慄追求者 ‧ 伊達政宗, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1489
// No. 1493 震疫驅瘟 ‧ 瑞龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1493
// No. 1494 金蛋守護者, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1494
// No. 1492 多情刀客 ‧ 真田幸村, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1492
// No. 1718 金果蛾龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1718
// No. 1506 清香白蓮 ‧ 素還真, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1506
// No. 1507 火宅佛獄的異數 ‧ 魔王子, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1507
// No. 1508 慈光之塔的驚嘆 ‧ 劍之初, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1508
// No. 1509 百世經綸 ‧ 一頁書, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1509
// No. 1510 刀狂劍痴 ‧ 葉小釵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1510
// No. 1511 殺戮碎島的救贖 ‧ 戢武王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1511
// No. 1132 森林暗鬼 ‧ 斯蘭達, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1132
// No. 1133 睿哲的開導 ‧ 安努, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1133
// No. 1512 傲笑紅塵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1512
// No. 1513 魔流劍 ‧ 風之痕, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1513
// No. 1134 曠古戰王 ‧ 吉爾伽美什, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1134
// No. 1722 機鎧構想 ‧ 弗愛, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1722
// No. 1721 機鎧捨身 ‧ 艾普塞朗, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1721
// No. 1724 機鎧叛離 ‧ 史納莎, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1724
// No. 1725 機鎧聯結 ‧ 貝塔與阿爾法, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1725
// No. 1521 煙螢夜瓏 ‧ 灼蘿, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1521
// No. 1735 秘術的果實, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1735
// No. 1738 勝臨之機銳槍 ‧ 岡尼爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1738
// No. 1739 艾爾芙萊姆的女王 ‧ 蘿斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1739
// No. 1741 荒龍復魂 ‧ 天叢雲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1741
// No. 1740 太學一番 ‧ 孔子, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1740
// No. 1742 破築的連創 ‧ 璐畢卡, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1742
// No. 1744 使命恪守 ‧ 多魯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1744
// No. 7013 噬人旅者 ‧ 佩利冬, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7013
// No. 7014 蘭陵王 ‧ 高長恭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7014
// No. 8015 妙妙貓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8015
// No. 8016 冥王哈帝斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8016
// No. 8017 巫師賈方, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8017
// No. 8018 匈奴將軍單於, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8018
// No. 8019 篡奪者刀疤, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8019
// No. 8020 霍博士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8020
// No. 8021 查立保, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8021
// No. 1163 海盜王 ‧ 弗朗西斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1163
// No. 1164 正義的酷刑 ‧ 假面判官, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1164
// No. 1165 陰陽搜靈 ‧ 黑白無常, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1165
{1536 : 1537},
{1538 : 1539},
{1536 : 1537},
{1538 : 1539},
{1540 : 1541},
{1540 : 1541},
{8043 : 8044},
{1542 : 1543},
{1542 : 1543},
{1544 : 1545},
// No. 1197 熾熱血牢 ‧ 拿姆, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1197
// No. 1196 樹蔭之目 ‧ 伊部, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1196
{1546 : 1547},
{1548 : 1549},
{1546 : 1547},
{1548 : 1549},
// No. 1198 魅之歌姬 ‧ 派蒙, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1198
{1550 : 1551},
{1550 : 1551},
// No. 1213 溫婉白蕾 ‧ 妍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1213
// No. 1214 翱翔銀翼 ‧ 科雷, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1214
{1544 : 1545},
// No. 1555 疾馳傳訊 ‧ 天馬座珀伽索斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1555
// No. 1252 不潔誘惑 ‧ 莉拉可, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1252
// No. 1253 墓劍銘 ‧ 干將莫邪, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1253
// No. 1254 千子斬 ‧ 妖刀村正, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1254
// No. 1255 久煉千靈 ‧ 六耳獼猴, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1255
// No. 1556 無知的天真 ‧ 海豚座絲諾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1556
// No. 1557 優雅滑行 ‧ 天鵝座涅墨西斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1557
// No. 1558 輝翼遨遊 ‧ 鳳凰座科爾武, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1558
{1565 : 1346},
{1565 : 1347},
{1565 : 1348},
{1565 : 1350},
// No. 1572 烈陽赤炎 ‧ 草薙京, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1572
// No. 1571 龍拳少年 ‧ 椎拳崇, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1571
// No. 1573 熱血蹴拳王 ‧ 金家藩, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1573
// No. 1574 雷光美獸 ‧ 二階堂紅丸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1574
// No. 1575 紫藍之月 ‧ 八神庵, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1575
// No. 1576 忍術的傳承 ‧ 不知火舞, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1576
// No. 1577 餓狼狂嚎 ‧ 泰利波格, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1577
// No. 1578 超能女高中生 ‧ 麻宮雅典娜, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1578
// No. 1587 箭神在野 ‧ 后羿, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1587
// No. 1586 極藍震動 ‧ 果凍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1586
{1601 : 1602},
{1601 : 1602},
{1603 : 1604},
{1603 : 1604},
// No. 1293 野熊將 ‧ 張飛, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1293
{1605 : 1606},
{1605 : 1606},
// No. 1295 愁楚孤女 ‧ 甄宓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1295
{1607 : 1608},
{1607 : 1608},
{1609 : 1610},
{1609 : 1610},
{1611 : 1612},
{1611 : 1612},
{1613 : 1614},
{1613 : 1614},
{1615 : 1616},
{1615 : 1616},
// No. 1620 慈愛紮根 ‧ 千歲蘭, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1620
// No. 1621 灌溉盎然 ‧ 時鐘藤, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1621
// No. 1622 挺拔固守 ‧ 仙人掌, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1622
// No. 1623 香甜殺意 ‧ 諾亞, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1623
// No. 1626 賢智泉源 ‧ 亞特蘭堤斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1626
{1636 : 1637},
{1636 : 1637},
{1638 : 1639},
{1640 : 1641},
{1640 : 1641},
{1642 : 1643},
{1642 : 1643},
{1644 : 1645},
{1638 : 1639},
{1644 : 1645},
{1646 : 1647},
{1648 : 1649},
{1648 : 1649},
{1650 : 1651},
{1650 : 1651},
{1646 : 1647},
// No. 1655 統覺進化 ‧ 莫爾迪基安, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1655
// No. 1656 元素連結 ‧ 塔維爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1656
// No. 1658 祈願實現 ‧ 緋花, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1658
// No. 1660 動力核心, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1660
{522 : 1661},
{524 : 1662},
{526 : 1663},
{528 : 1664},
{530 : 1665},
// No. 1657 世界線的觀測者 ‧ 伊塔庫亞, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1657
// No. 1666 流沙河魔將 ‧ 沙僧, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1666
// No. 1667 蓮花洞雙童 ‧ 金角與銀角, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1667
// No. 1668 天蓬使者 ‧ 豬八戒, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1668
// No. 1670 盤絲洞主 ‧ 蜘蛛精, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1670
{1671 : 1672},
{1671 : 1672},
{1673 : 1674},
{1675 : 1676},
{1673 : 1674},
{1675 : 1676},
{1677 : 1678},
{1679 : 1680},
{1681 : 1682},
{1679 : 1680},
{1681 : 1682},
{1683 : 1684},
{1683 : 1684},
{1677 : 1678},
{1685 : 1686},
{1685 : 1686},
// No. 1690 好運常在 ‧ 張遼, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1690
// No. 1691 老奸巨猾 ‧ 董卓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1691
// No. 1692 刁潑巾幗 ‧ 關銀屏, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1692
// No. 1695 三星拱照 ‧ 福祿壽, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1695
// No. 1701 笑看紅塵 ‧ 藍采和, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1701
// No. 1703 血植異足 ‧ 鐵拐李, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1703
// No. 1704 菡萏香銷 ‧ 何仙姑, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1704
// No. 1705 劍氣御神 ‧ 呂洞賓, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1705
// No. 1706 正陽真人 ‧ 鍾離權, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1706
// No. 1432 梵天守門者 ‧ 毘沙門天, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1432
// No. 1433 五眼怒嚴 ‧ 金剛夜叉明王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1433
// No. 1436 斷惡修善 ‧ 不動明王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1436
// No. 1437 護生明君 ‧ 大國主, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1437
// No. 1464 自由蒼蝶 ‧ 桂妮薇兒, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1464
{829 : 1716},
// No. 1715 門之鑰, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1715
// No. 1717 心願彩蛋 ‧ 黃色小雞, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1717
// No. 1487 五感響宴 ‧ 上杉謙信, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1487
// No. 1488 忌心妒者 ‧ 明智光秀, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1488
// No. 1498 百川海中主 ‧ 蛟龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1498
// No. 1499 冥縱之凶獅 ‧ 基加美修, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1499
// No. 1719 燃火末日 ‧ 龐貝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1719
// No. 1720 機鎧昂揚 ‧ 貝塔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1720
// No. 1723 機鎧岑寂 ‧ 阿爾法, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1723
// No. 1517 七星之主 ‧ 天策真龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1517
// No. 1518 毀滅之神 ‧ 棄天帝, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1518
// No. 1519 邪尊道之主 ‧ 妖后, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1519
// No. 1726 不可能性現翼 ‧ 莫比烏斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1726
// No. 1727 想心之戀鎖 ‧ 摩斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1727
// No. 1728 最終焉算之鋼砲 ‧ 圖靈, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1728
// No. 1729 電裝烙雷芯 ‧ 法拉第, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1729
// No. 1523 無盡夢境 ‧ 睡魔, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1523
// No. 1730 夢二夢斬之游獵 ‧ 佛洛伊德, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1730
// No. 1731 廣寒宮護主 ‧ 嫦娥, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1731
// No. 1732 帝冷的劍氏 ‧ 攝爾修斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1732
// No. 1733 華熱的麗腳 ‧ 華倫海特, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1733
// No. 1734 宇宙天紡的星明 ‧ 哈勃, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1734
// No. 7001 火慾母神 ‧ 莎布尼古拉絲, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7001
// No. 7002 大陰陽師 ‧ 安倍晴明, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7002
// No. 7003 巫山鬼姬 ‧ 瑤姬, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7003
// No. 7004 信念承傳 ‧ 輝煌騎士, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7004
// No. 7005 阿修羅王 ‧ 羅侯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7005
// No. 7006 善惡顛倒 ‧ 窮奇, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7006
// No. 7007 虛無之頌歌 ‧ 菲爾卡, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7007
// No. 7008 九首凶龍 ‧ 九嬰, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7008
// No. 7009 隱形殺戮者 ‧ 七ＯＯ九, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7009
// No. 7011 罪律審神 ‧ 閻羅, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7011
// No. 7010 煙霧鏡 ‧ 特斯卡特利波卡, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7010
// No. 7012 疾風繾綣 ‧ 風狸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/7012
{8001 : 8002},
{8001 : 8002},
{8003 : 8004},
{8005 : 8006},
{8003 : 8004},
{8005 : 8006},
{8007 : 8008},
{8007 : 8008},
{8009 : 8010},
{8009 : 8010},
{8011 : 8012},
{8011 : 8012},
{8013 : 8014},
{8013 : 8014},
// No. 8025 巫毒好友, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8025
// No. 8024 約翰親王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8024
// No. 8026 胡善與賈善, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8026
// No. 8027 鱷魚滴噠, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8027
// No. 8028 卡奧, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8028
// No. 8029 艾格, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8029
// No. 8030 壞蛋烏鴉, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8030
{8031 : 8032},
{8031 : 8032},
{8033 : 8034},
{8033 : 8034},
{8035 : 8036},
{8035 : 8036},
{8037 : 8038},
{8037 : 8038},
{8039 : 8040},
{8039 : 8040},
{8041 : 8042},
{8041 : 8042},
{8043 : 8044},
{9001 : 9002},
{9001 : 9002},
{9003 : 9004},
{9003 : 9004},
{9005 : 9006},
{9005 : 9006},
{9007 : 9008},
{9009 : 9010},
{9009 : 9010},
{9011 : 9012},
{9011 : 9012},
{9013 : 9014},
{9013 : 9014},
{9007 : 9008},
// No. 1552 不破護行 ‧ 武仙座海格力斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1552
// No. 1553 命之真意 ‧ 獵戶座俄里翁, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1553
// No. 1554 信守諾言 ‧ 天兔座球球, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1554
// No. 1579 萬物之念 ‧ 大蛇, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1579
// No. 1580 虐殺交響曲 ‧ 路卡爾, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1580
// No. 1617 捕食惡意 ‧ 食人花, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1617
// No. 1618 枯旱遺志 ‧ 含羞草, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1618
// No. 1619 憎恨蓬勃 ‧ 罌粟, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1619
// No. 1653 容納侵蝕 ‧ 阿爾瓦撒, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1653
// No. 1652 存留的火舌 ‧ 弗塔古亞, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1652
// No. 1654 敗德的散播 ‧ 伊戈隆納克, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1654
// No. 1687 匠氣興霸 ‧ 甘寧, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1687
// No. 1688 號令羊駝 ‧ 馬超, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1688
// No. 1689 離經叛道 ‧ 張角, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1689
// No. 1699 黝光萬丈 · 神皇宙斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1699
// No. 1710 魅惑他心 ‧ 白面狐狸, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1710
// No. 1711 磷火奪嬰 ‧ 姑獲鳥, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1711
// No. 1736 萬世始皇帝 ‧ 嬴政, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1736
// No. 1737 炎影的征討者 ‧ 織田信長, 找不到進化資訊: http://zh.tos.wikia.com/wiki/1737
// No. 8022 犄角魔王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8022
// No. 8023 梅菲瑟龍, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8023
// No. 8045 大壞蛋彼德, 找不到進化資訊: http://zh.tos.wikia.com/wiki/8045
// No. 9015 世界的智慧 · 所羅門王, 找不到進化資訊: http://zh.tos.wikia.com/wiki/9015
// No. 9016 獨角公爵 · 安度西亞斯, 找不到進化資訊: http://zh.tos.wikia.com/wiki/9016
];
var evoData = {};
originData.forEach((ele) => {
    let key = Object.keys(ele),
        value = Object.values(ele);
    if (! evoData[key]) {
        evoData[key] = [];
    }
    evoData[key].push(value[0]);
    evoData[key] = [...new Set(evoData[key])];
});

var degData = {};
Object.keys(evoData).forEach((e) => {
    evoData[e].forEach((val) => {
        if (! degData[val]) {
            degData[val] = [];
        }
        degData[val].push(e);
    });
});